{"pageProps":{"slug":"privacy-policy","data":{"frontmatter":{"title":"Privacy Policy","image":"/images/author.png","description":"meta description","layout":"default"},"content":"\nEffective Date: 01/01/2023\n\nSplashhh (\"us\", \"we\", or \"our\") operates the Splashhh website and apps (the \"Service\").\n\nThis page informs you of our policies regarding the collection, use, and disclosure of personal data when you use our Service and the choices you have associated with that data. We take your privacy seriously and will only use your personal data in accordance with this Privacy Policy.\n\n### Information Collection and Use\n\nWe collect several types of information for various purposes to provide and improve our Service to you.\n\nTypes of Data Collected:\n\nPersonal Data: While using our Service, we may ask you to provide us with certain personally identifiable information that can be used to contact or identify you (\"Personal Data\"). Personally identifiable information may include, but is not limited to:\n\n- Email address\n- First name and last name\n- Phone number\n- Address, State, Province, ZIP/Postal code, City\n- Cookies and Usage Data\n\n \nUsage Data: We may also collect information on how the Service is accessed and used (\"Usage Data\"). This Usage Data may include information such as your computer's Internet Protocol address (e.g. IP address), browser type, browser version, the pages of our Service that you visit, the time and date of your visit, the time spent on those pages, unique device identifiers and other diagnostic data.\n\nCookies Data: We use cookies and similar tracking technologies to track the activity on our Service and hold certain information.\n\n### Use of Data\n\nWe use the collected data for various purposes:\n\nTo provide and maintain our Service\nTo notify you about changes to our Service\nTo allow you to participate in interactive features of our Service\nTo provide customer support\nTo gather analysis or valuable information so that we can improve our Service\nTo monitor the usage of our Service\nTo detect, prevent and address technical issues\nTransfer of Data\n\nYour information, including Personal Data, may be transferred to — and maintained on — computers located outside of your state, province, country, or other governmental jurisdiction where the data protection laws may differ from those of your jurisdiction.\n\nIf you are located outside the United States and choose to provide information to us, please note that we transfer the data, including Personal Data, to the United States and process it there.\n\nYour consent to this Privacy Policy followed by your submission of such information represents your agreement to that transfer.\n\n### Disclosure of Data\n\nWe may disclose your Personal Data in the good faith belief that such action is necessary to:\n\nComply with a legal obligation\nProtect and defend our rights or property\nPrevent or investigate possible wrongdoing in connection with the Service\nProtect the personal safety of users of the Service or the public\nProtect against legal liability\nSecurity of Data\n\nThe security of your data is important to us, but remember that no method of transmission over the Internet or method of electronic storage is 100% secure. While we strive to use commercially acceptable means to protect your Personal Data, we cannot guarantee its absolute security.\n\n### Service Providers\n\nWe may employ third party companies and individuals to facilitate our Service (\"Service Providers\"), to provide the Service on our behalf, to perform Service-related services or to assist us in analyzing how our Service is used.\n\nThese third parties have access to your Personal Data only to perform these tasks on our behalf and are obligated not to disclose or use it for any other purpose.\n\n### Links to Other Sites\n\nOur Service may contain links to other sites that are not operated by us. If you click on a third party link, you will be directed to that third party's site. We strongly advise you to review the Privacy Policy of every site you visit.\n\nWe have no control over and assume no responsibility for the content, privacy policies, or practices of any third party sites or services.\n\n### Children's Privacy\n\nOur Service does not address anyone under the age of 18 (\"Children\").\n\nWe do not knowingly collect personally identifiable information from anyone under the age of 18. If you are a parent or guardian and you are aware that your child has provided us with Personal Data, please contact us. If we become aware that we have collected Personal Data from children without verification of parental consent, we take steps to remove that information from our servers.\n\n### Changes to This Privacy Policy\n\nWe may update our Privacy Policy from time to time. We will notify you of any changes by posting the new Privacy Policy on this page.\n\nWe will let you know via email and/or a prominent notice on our Service, prior to the change becoming effective and update the \"effective date\" at the top of this Privacy Policy.\n\nYou are advised to review this Privacy Policy periodically for any changes. Changes to this Privacy Policy are effective when they are posted on this page.\n\n### Contact Us\n\nIf you have any questions about this Privacy Policy, please contact us:\n\nBy email: TBD\n\nBy visiting this page on our website: TBD\n\nBy mail: TBD\n","mdxContent":{"compiledSource":"/*@jsxRuntime automatic @jsxImportSource react*/\nconst {Fragment: _Fragment, jsx: _jsx, jsxs: _jsxs} = arguments[0];\nconst {useMDXComponents: _provideComponents} = arguments[0];\nfunction _createMdxContent(props) {\n  const _components = Object.assign({\n    p: \"p\",\n    h3: \"h3\",\n    ul: \"ul\",\n    li: \"li\"\n  }, _provideComponents(), props.components);\n  return _jsxs(_Fragment, {\n    children: [_jsx(_components.p, {\n      children: \"Effective Date: 01/01/2023\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Splashhh (\\\"us\\\", \\\"we\\\", or \\\"our\\\") operates the Splashhh website and apps (the \\\"Service\\\").\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"This page informs you of our policies regarding the collection, use, and disclosure of personal data when you use our Service and the choices you have associated with that data. We take your privacy seriously and will only use your personal data in accordance with this Privacy Policy.\"\n    }), \"\\n\", _jsx(_components.h3, {\n      id: \"information-collection-and-use\",\n      children: \"Information Collection and Use\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"We collect several types of information for various purposes to provide and improve our Service to you.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Types of Data Collected:\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Personal Data: While using our Service, we may ask you to provide us with certain personally identifiable information that can be used to contact or identify you (\\\"Personal Data\\\"). Personally identifiable information may include, but is not limited to:\"\n    }), \"\\n\", _jsxs(_components.ul, {\n      children: [\"\\n\", _jsxs(_components.li, {\n        children: [\"\\n\", _jsx(_components.p, {\n          children: \"Email address\"\n        }), \"\\n\"]\n      }), \"\\n\", _jsxs(_components.li, {\n        children: [\"\\n\", _jsx(_components.p, {\n          children: \"First name and last name\"\n        }), \"\\n\"]\n      }), \"\\n\", _jsxs(_components.li, {\n        children: [\"\\n\", _jsx(_components.p, {\n          children: \"Phone number\"\n        }), \"\\n\"]\n      }), \"\\n\", _jsxs(_components.li, {\n        children: [\"\\n\", _jsx(_components.p, {\n          children: \"Address, State, Province, ZIP/Postal code, City\"\n        }), \"\\n\"]\n      }), \"\\n\", _jsxs(_components.li, {\n        children: [\"\\n\", _jsx(_components.p, {\n          children: \"Cookies and Usage Data\"\n        }), \"\\n\"]\n      }), \"\\n\"]\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Usage Data: We may also collect information on how the Service is accessed and used (\\\"Usage Data\\\"). This Usage Data may include information such as your computer's Internet Protocol address (e.g. IP address), browser type, browser version, the pages of our Service that you visit, the time and date of your visit, the time spent on those pages, unique device identifiers and other diagnostic data.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Cookies Data: We use cookies and similar tracking technologies to track the activity on our Service and hold certain information.\"\n    }), \"\\n\", _jsx(_components.h3, {\n      id: \"use-of-data\",\n      children: \"Use of Data\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"We use the collected data for various purposes:\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"To provide and maintain our Service\\nTo notify you about changes to our Service\\nTo allow you to participate in interactive features of our Service\\nTo provide customer support\\nTo gather analysis or valuable information so that we can improve our Service\\nTo monitor the usage of our Service\\nTo detect, prevent and address technical issues\\nTransfer of Data\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Your information, including Personal Data, may be transferred to — and maintained on — computers located outside of your state, province, country, or other governmental jurisdiction where the data protection laws may differ from those of your jurisdiction.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"If you are located outside the United States and choose to provide information to us, please note that we transfer the data, including Personal Data, to the United States and process it there.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Your consent to this Privacy Policy followed by your submission of such information represents your agreement to that transfer.\"\n    }), \"\\n\", _jsx(_components.h3, {\n      id: \"disclosure-of-data\",\n      children: \"Disclosure of Data\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"We may disclose your Personal Data in the good faith belief that such action is necessary to:\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Comply with a legal obligation\\nProtect and defend our rights or property\\nPrevent or investigate possible wrongdoing in connection with the Service\\nProtect the personal safety of users of the Service or the public\\nProtect against legal liability\\nSecurity of Data\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"The security of your data is important to us, but remember that no method of transmission over the Internet or method of electronic storage is 100% secure. While we strive to use commercially acceptable means to protect your Personal Data, we cannot guarantee its absolute security.\"\n    }), \"\\n\", _jsx(_components.h3, {\n      id: \"service-providers\",\n      children: \"Service Providers\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"We may employ third party companies and individuals to facilitate our Service (\\\"Service Providers\\\"), to provide the Service on our behalf, to perform Service-related services or to assist us in analyzing how our Service is used.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"These third parties have access to your Personal Data only to perform these tasks on our behalf and are obligated not to disclose or use it for any other purpose.\"\n    }), \"\\n\", _jsx(_components.h3, {\n      id: \"links-to-other-sites\",\n      children: \"Links to Other Sites\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Our Service may contain links to other sites that are not operated by us. If you click on a third party link, you will be directed to that third party's site. We strongly advise you to review the Privacy Policy of every site you visit.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"We have no control over and assume no responsibility for the content, privacy policies, or practices of any third party sites or services.\"\n    }), \"\\n\", _jsx(_components.h3, {\n      id: \"childrens-privacy\",\n      children: \"Children's Privacy\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Our Service does not address anyone under the age of 18 (\\\"Children\\\").\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"We do not knowingly collect personally identifiable information from anyone under the age of 18. If you are a parent or guardian and you are aware that your child has provided us with Personal Data, please contact us. If we become aware that we have collected Personal Data from children without verification of parental consent, we take steps to remove that information from our servers.\"\n    }), \"\\n\", _jsx(_components.h3, {\n      id: \"changes-to-this-privacy-policy\",\n      children: \"Changes to This Privacy Policy\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"We may update our Privacy Policy from time to time. We will notify you of any changes by posting the new Privacy Policy on this page.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"We will let you know via email and/or a prominent notice on our Service, prior to the change becoming effective and update the \\\"effective date\\\" at the top of this Privacy Policy.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"You are advised to review this Privacy Policy periodically for any changes. Changes to this Privacy Policy are effective when they are posted on this page.\"\n    }), \"\\n\", _jsx(_components.h3, {\n      id: \"contact-us\",\n      children: \"Contact Us\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"If you have any questions about this Privacy Policy, please contact us:\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"By email: TBD\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"By visiting this page on our website: TBD\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"By mail: TBD\"\n    })]\n  });\n}\nfunction MDXContent(props = {}) {\n  const {wrapper: MDXLayout} = Object.assign({}, _provideComponents(), props.components);\n  return MDXLayout ? _jsx(MDXLayout, Object.assign({}, props, {\n    children: _jsx(_createMdxContent, props)\n  })) : _createMdxContent(props);\n}\nreturn {\n  default: MDXContent\n};\n","frontmatter":{},"scope":{}}}},"__N_SSG":true}