{"pageProps":{"slug":"terms-of-usage","data":{"frontmatter":{"title":"Terms of Use","description":"Terms of Use","layout":"default"},"content":"\nEffective Date: 01/01/2023\n\nPlease read these Terms of Use (\"Terms\", \"Terms of Use\") carefully before using the Splashhh website and apps (the \"Service\") operated by Splashhh (\"us\", \"we\", or \"our\").\n\nYour access to and use of the Service is conditioned on your acceptance of and compliance with these Terms. These Terms apply to all visitors, users, and others who access or use the Service.\n\nBy accessing or using the Service, you agree to be bound by these Terms. If you disagree with any part of the terms, then you may not access the Service.\n\n### Content\n\nOur Service allows you to create and manipulate images using generative AI algorithms. You are solely responsible for any content, images, or other materials that you upload, post, or otherwise make available through the Service (\"Content\").\n\nYou retain all rights in, and are solely responsible for, the Content that you create and manipulate through the Service. We do not claim ownership of any Content that you create or manipulate using our Service.\n\nBy uploading, posting, or otherwise making available Content through the Service, you grant us a non-exclusive, transferable, sub-licensable, royalty-free, worldwide license to use, copy, modify, create derivative works based on, distribute, publicly display, publicly perform, and otherwise exploit in any manner such Content in all formats and distribution channels now known or hereafter devised (including in connection with the Service and our business and on third-party sites and services), without further notice to or consent from you, and without the requirement of payment to you or any other person or entity.\n\nYou represent and warrant that: (i) the Content is yours (you own it) or you have the right to use it and grant us the rights and license as provided in these Terms, and (ii) the posting of your Content on or through the Service does not violate the privacy rights, publicity rights, copyrights, contract rights, or any other rights of any person.\n\n### Accounts\n\nWhen you create an account with us, you must provide accurate and complete information. You are responsible for maintaining the confidentiality of your account login information and are fully responsible for all activities that occur under your account.\n\nWe reserve the right to suspend or terminate your account at any time without prior notice or liability for any reason, including, but not limited to, if we determine that you have violated these Terms or any applicable law.\n\n### Prohibited Uses\n\nYou may use the Service only for lawful purposes and in accordance with these Terms. You agree not to use the Service:\n\nIn any way that violates any applicable federal, state, local, or international law or regulation (including, without limitation, any laws regarding the export of data or software to and from the United States or other countries).\nFor the purpose of exploiting, harming, or attempting to exploit or harm minors in any way by exposing them to inappropriate content or otherwise.\nTo transmit, or procure the sending of, any advertising or promotional material, including any \"junk mail,\" \"chain letter,\" \"spam,\" or any other similar solicitation.\nTo impersonate or attempt to impersonate the Company, a Company employee, another user, or any other person or entity (including, without limitation, by using email addresses or screen names associated with any of the foregoing).\nTo engage in any other conduct that restricts or inhibits anyone's use or enjoyment of the Service, or which, as determined by us, may harm the Company or users of the Service or expose them to liability.\nIntellectual Property\n\nThe Service and its entire contents, features, and functionality (including but not limited to all information, software, text, displays, images, video, and audio, and the design, selection, and arrangement thereof), are owned by the Company, its licensors, or other providers of such material and are protected by United States and international copyright, trademark, patent, trade secret, and other intellectual property or proprietary rights laws.\n\nThese Terms permit you to use the Service for your personal, non-commercial use only. You must not reproduce, distribute, modify, create derivative works of, publicly display, publicly perform, republish, download, store, or transmit any of the material on our Service, except as follows:\n\nYour computer may temporarily store copies of such materials in RAM incidental to your accessing and viewing those materials.\nYou may store files that are automatically cached by your Web browser for display enhancement purposes.\nYou may print or download one copy of a reasonable number of pages of the Service for your own personal, non-commercial use and not for further reproduction, publication, or distribution.\nIf we provide desktop, mobile, or other applications for download, you may download a single copy to your computer or mobile device solely for your own personal, non-commercial use, and not for further reproduction, publication, or distribution. If we provide social media features with certain content, you may take such actions as are enabled by such features.\n\nYou must not:\n\nModify copies of any materials from this site.\nUse any illustrations, photographs, video or audio sequences, or any graphics separately from the accompanying text.\nDelete or alter any copyright, trademark, or other proprietary rights notices from copies of materials from this site.\nIf you print, copy, modify, download, or otherwise use or provide any other person with access to any part of the Service in breach of the Terms, your right to use the Service will stop immediately, and you must, at our option, return or destroy any copies of the materials you have made. Any unauthorized use may also violate applicable laws, including without limitation copyright and trademark laws and applicable communications regulations and statutes.\n\n### Disclaimer of Warranties\n\nThe Service is provided \"AS IS\" and \"AS AVAILABLE\" without any representations or warranties, express or implied. We do not warrant that the Service will be uninterrupted, timely, secure, or error-free, or that any defects will be corrected. We do not warrant that the results that may be obtained from the use of the Service will be accurate or reliable.\n\nWe expressly disclaim all warranties of any kind, whether express or implied, including, but not limited to, the implied warranties of merchantability, fitness for a particular purpose, and non-infringement.\n\n### Limitation of Liability\n\nIn no event shall the Company, its directors, officers, employees, affiliates, agents, contractors, suppliers, licensors, or service providers be liable for any direct, indirect, incidental, consequential, special, or punitive damages, including without limitation, loss of profits, data, use, goodwill, or other intangible losses, resulting from (i) your access to or use of or inability to access or use the Service, (ii) any conduct or content of any third party on the Service, (iii) any content obtained from the Service, or (iv) unauthorized access, use, or alteration of your transmissions or content, whether based on warranty, contract, tort (including negligence), or any other legal theory, whether or not we have been informed of the possibility of such damage, and even if a remedy set forth herein is found to have failed of its essential purpose.\n\n### Indemnification\n\nYou agree to indemnify, defend, and hold harmless the Company, its directors, officers, employees, affiliates, agents, contractors, licensors, and service providers from any and all claims, liabilities, damages, judgments, awards, losses, costs, expenses, or fees (including reasonable attorneys ' fees) arising out of or relating to your violation of these Terms or your use of the Service, including, but not limited to:\n\nYour use of any content available on the Service, including any content that you upload, create, modify, distribute, or otherwise make available through the Service.\nYour violation of any third-party right, including without limitation any intellectual property, privacy, or publicity right.\nYour violation of any law, rule, or regulation.\nAny claim or damage that arises from your use of any information, data, or material from the Service.\nWe reserve the right to assume the exclusive defense and control of any matter otherwise subject to indemnification by you, in which event you will cooperate with us in asserting any available defenses.\n\n### Termination\n\nWe may terminate or suspend your access to all or any part of the Service at any time, with or without cause, with or without notice, effective immediately. If you wish to terminate these Terms, you may discontinue using the Service.\n\nAll provisions of these Terms, which by their nature should survive termination, shall survive termination, including, without limitation, ownership provisions, warranty disclaimers, indemnity, and limitations of liability.\n\n### Governing Law and Jurisdiction\n\nThese Terms shall be governed by and construed in accordance with the laws of the State of California, without regard to its conflict of law provisions.\n\nAny legal suit, action, or proceeding arising out of, or related to, these Terms or the Service shall be instituted exclusively in the federal courts of the United States or the courts of the State of California in each case located in San Francisco County. You waive any and all objections to the exercise of jurisdiction over you by such courts and to venue in such courts.\n\n### Entire Agreement\n\nThese Terms and our Privacy Policy constitute the sole and entire agreement between you and the Company regarding the Service and supersede all prior and contemporaneous understandings, agreements, representations, and warranties, both written and oral, regarding the Service.\n\n### No Waiver\n\nOur failure to enforce any right or provision of these Terms will not be deemed a waiver of such right or provision.\n\nIf any provision of these Terms is held to be invalid or unenforceable by a court or other tribunal of competent jurisdiction, the remaining provisions of these Terms will remain in full force and effect.\n\n### Assignment\n\nThese Terms and any rights and licenses granted hereunder, may not be transferred or assigned by you, but may be assigned by us without restriction or notification.\n\n### Force Majeure\n\nWe shall not be liable for any failure to perform our obligations hereunder where such failure results from any cause beyond our reasonable control, including, without limitation, mechanical, electronic, or communications failure or degradation.\n\n### No Agency\n\nNo agency, partnership, joint venture, or employment relationship is created as a result of these Terms, and you may not make any representations on our behalf.\n\n### Headings\n\nThe section titles in these Terms are for convenience only and have no legal or contractual effect.\n\n### Survival\n\nAll provisions of these Terms which by their nature should survive termination shall survive termination, including, without limitation, ownership provisions, warranty disclaimers, indemnity, and limitations of liability.\n\n### User-Generated Content\n\nThe Service may allow you to submit, upload, publish, or otherwise make available content, including but not limited to text, images, audio, video, and other materials (\"User Content\"). You retain ownership of any intellectual property rights that you hold in the User Content, but you grant us a non-exclusive, royalty-free, transferable, sub-licensable, worldwide license to use, reproduce, distribute, prepare derivative works of, display, and perform your User Content in connection with the Service and our business, including without limitation for promoting and redistributing part or all of the Service (and derivative works thereof) in any media formats and through any media channels.\n\nYou represent and warrant that you have all rights, licenses, consents, and releases that are necessary to grant to us the license above and that the User Content and your use of the Service will not infringe or violate any third-party rights, including without limitation any intellectual property, privacy, or publicity rights. We reserve the right to remove any User Content from the Service at any time and for any reason, including without limitation if it violates these Terms or our policies.\n\n### Links to Third-Party Websites or Resources\n\nThe Service may contain links to third-party websites or resources. We provide these links only as a convenience and are not responsible for the content, products, or services on or available from those websites or resources or links displayed on such websites. You acknowledge sole responsibility for and assume all risk arising from your use of any third-party websites or resources.\n\n### Disclaimer of Warranties\n\nThe Service is provided \"as is,\" without warranty of any kind, either express or implied, including without limitation any warranty for information, services, uninterrupted access, or products provided through or in connection with the Service, including without limitation the software licensed to you and the results obtained through the Service. Specifically, we disclaim any and all warranties, including without limitation: 1) Any warranties concerning the availability, accuracy, usefulness, or content of information, products, or services; and 2) Any warranties of title, warranty of non-infringement, warranties of merchantability, or fitness for a particular purpose. This disclaimer of liability applies to any damages or injury caused by any failure of performance, error, omission, interruption, deletion, defect, delay in operation or transmission, computer virus, communication line failure, theft, or destruction or unauthorized access to, alteration of, or use of record, whether for breach of contract, tortious behavior, negligence, or under any other cause of action.\n\n### Limitation of Liability\n\nTo the fullest extent permitted by applicable law, in no event shall the Company, its affiliates, officers, directors, employees, agents, licensors, or service providers be liable for any direct, indirect, incidental, consequential, special, punitive, or exemplary damages, including without limitation damages for loss of profits, revenue, data, use, goodwill, or other intangible losses arising out of or relating to your use of the Service, whether based on warranty, contract, tort, negligence, strict liability, or any other legal theory, even if the Company has been advised of the possibility of such damages.\n\nSome jurisdictions do not allow the exclusion or limitation of liability for consequential or incidental damages, so the above limitation may not apply to you.\n\n### Waiver and Severability\n\nOur failure to enforce any right or provision of these Terms will not be deemed a waiver of such right or provision. If any provision of these Terms is held to be invalid or unenforceable by a court or other tribunal of competent jurisdiction, the remaining provisions of these Terms will remain in full force and effect.\n\nThese Terms constitute the entire agreement between you and us regarding the Service and supersede all prior or contemporaneous understandings or agreements, whether written or oral, regarding the Service.\n\n### Governing Law and Dispute Resolution\n\nThese Terms and any action related thereto will be governed by the laws of the State of [insert state], without regard to its conflict of law provisions. Any dispute arising from or relating to these Terms or the Service shall be resolved in accordance with the dispute resolution provisions outlined in our Privacy Policy.\n\n### Changes to These Terms\n\nWe reserve the right, at our sole discretion, to modify or replace these Terms at any time. If a revision is material, we will provide at least 30 days' notice prior to any new terms taking effect. What constitutes a material change will be determined at our sole discretion.\n\nBy continuing to access or use the Service after any revisions become effective, you agree to be bound by the updated Terms. If you do not agree to the new Terms, you are no longer authorized to use the Service.\n\n### Contact Us\n\nIf you have any questions about these Terms, please contact us at TBD.\n\n\n","mdxContent":{"compiledSource":"/*@jsxRuntime automatic @jsxImportSource react*/\nconst {Fragment: _Fragment, jsx: _jsx, jsxs: _jsxs} = arguments[0];\nconst {useMDXComponents: _provideComponents} = arguments[0];\nfunction _createMdxContent(props) {\n  const _components = Object.assign({\n    p: \"p\",\n    h3: \"h3\"\n  }, _provideComponents(), props.components);\n  return _jsxs(_Fragment, {\n    children: [_jsx(_components.p, {\n      children: \"Effective Date: 01/01/2023\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Please read these Terms of Use (\\\"Terms\\\", \\\"Terms of Use\\\") carefully before using the Splashhh website and apps (the \\\"Service\\\") operated by Splashhh (\\\"us\\\", \\\"we\\\", or \\\"our\\\").\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Your access to and use of the Service is conditioned on your acceptance of and compliance with these Terms. These Terms apply to all visitors, users, and others who access or use the Service.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"By accessing or using the Service, you agree to be bound by these Terms. If you disagree with any part of the terms, then you may not access the Service.\"\n    }), \"\\n\", _jsx(_components.h3, {\n      id: \"content\",\n      children: \"Content\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Our Service allows you to create and manipulate images using generative AI algorithms. You are solely responsible for any content, images, or other materials that you upload, post, or otherwise make available through the Service (\\\"Content\\\").\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"You retain all rights in, and are solely responsible for, the Content that you create and manipulate through the Service. We do not claim ownership of any Content that you create or manipulate using our Service.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"By uploading, posting, or otherwise making available Content through the Service, you grant us a non-exclusive, transferable, sub-licensable, royalty-free, worldwide license to use, copy, modify, create derivative works based on, distribute, publicly display, publicly perform, and otherwise exploit in any manner such Content in all formats and distribution channels now known or hereafter devised (including in connection with the Service and our business and on third-party sites and services), without further notice to or consent from you, and without the requirement of payment to you or any other person or entity.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"You represent and warrant that: (i) the Content is yours (you own it) or you have the right to use it and grant us the rights and license as provided in these Terms, and (ii) the posting of your Content on or through the Service does not violate the privacy rights, publicity rights, copyrights, contract rights, or any other rights of any person.\"\n    }), \"\\n\", _jsx(_components.h3, {\n      id: \"accounts\",\n      children: \"Accounts\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"When you create an account with us, you must provide accurate and complete information. You are responsible for maintaining the confidentiality of your account login information and are fully responsible for all activities that occur under your account.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"We reserve the right to suspend or terminate your account at any time without prior notice or liability for any reason, including, but not limited to, if we determine that you have violated these Terms or any applicable law.\"\n    }), \"\\n\", _jsx(_components.h3, {\n      id: \"prohibited-uses\",\n      children: \"Prohibited Uses\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"You may use the Service only for lawful purposes and in accordance with these Terms. You agree not to use the Service:\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"In any way that violates any applicable federal, state, local, or international law or regulation (including, without limitation, any laws regarding the export of data or software to and from the United States or other countries).\\nFor the purpose of exploiting, harming, or attempting to exploit or harm minors in any way by exposing them to inappropriate content or otherwise.\\nTo transmit, or procure the sending of, any advertising or promotional material, including any \\\"junk mail,\\\" \\\"chain letter,\\\" \\\"spam,\\\" or any other similar solicitation.\\nTo impersonate or attempt to impersonate the Company, a Company employee, another user, or any other person or entity (including, without limitation, by using email addresses or screen names associated with any of the foregoing).\\nTo engage in any other conduct that restricts or inhibits anyone's use or enjoyment of the Service, or which, as determined by us, may harm the Company or users of the Service or expose them to liability.\\nIntellectual Property\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"The Service and its entire contents, features, and functionality (including but not limited to all information, software, text, displays, images, video, and audio, and the design, selection, and arrangement thereof), are owned by the Company, its licensors, or other providers of such material and are protected by United States and international copyright, trademark, patent, trade secret, and other intellectual property or proprietary rights laws.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"These Terms permit you to use the Service for your personal, non-commercial use only. You must not reproduce, distribute, modify, create derivative works of, publicly display, publicly perform, republish, download, store, or transmit any of the material on our Service, except as follows:\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Your computer may temporarily store copies of such materials in RAM incidental to your accessing and viewing those materials.\\nYou may store files that are automatically cached by your Web browser for display enhancement purposes.\\nYou may print or download one copy of a reasonable number of pages of the Service for your own personal, non-commercial use and not for further reproduction, publication, or distribution.\\nIf we provide desktop, mobile, or other applications for download, you may download a single copy to your computer or mobile device solely for your own personal, non-commercial use, and not for further reproduction, publication, or distribution. If we provide social media features with certain content, you may take such actions as are enabled by such features.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"You must not:\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Modify copies of any materials from this site.\\nUse any illustrations, photographs, video or audio sequences, or any graphics separately from the accompanying text.\\nDelete or alter any copyright, trademark, or other proprietary rights notices from copies of materials from this site.\\nIf you print, copy, modify, download, or otherwise use or provide any other person with access to any part of the Service in breach of the Terms, your right to use the Service will stop immediately, and you must, at our option, return or destroy any copies of the materials you have made. Any unauthorized use may also violate applicable laws, including without limitation copyright and trademark laws and applicable communications regulations and statutes.\"\n    }), \"\\n\", _jsx(_components.h3, {\n      id: \"disclaimer-of-warranties\",\n      children: \"Disclaimer of Warranties\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"The Service is provided \\\"AS IS\\\" and \\\"AS AVAILABLE\\\" without any representations or warranties, express or implied. We do not warrant that the Service will be uninterrupted, timely, secure, or error-free, or that any defects will be corrected. We do not warrant that the results that may be obtained from the use of the Service will be accurate or reliable.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"We expressly disclaim all warranties of any kind, whether express or implied, including, but not limited to, the implied warranties of merchantability, fitness for a particular purpose, and non-infringement.\"\n    }), \"\\n\", _jsx(_components.h3, {\n      id: \"limitation-of-liability\",\n      children: \"Limitation of Liability\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"In no event shall the Company, its directors, officers, employees, affiliates, agents, contractors, suppliers, licensors, or service providers be liable for any direct, indirect, incidental, consequential, special, or punitive damages, including without limitation, loss of profits, data, use, goodwill, or other intangible losses, resulting from (i) your access to or use of or inability to access or use the Service, (ii) any conduct or content of any third party on the Service, (iii) any content obtained from the Service, or (iv) unauthorized access, use, or alteration of your transmissions or content, whether based on warranty, contract, tort (including negligence), or any other legal theory, whether or not we have been informed of the possibility of such damage, and even if a remedy set forth herein is found to have failed of its essential purpose.\"\n    }), \"\\n\", _jsx(_components.h3, {\n      id: \"indemnification\",\n      children: \"Indemnification\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"You agree to indemnify, defend, and hold harmless the Company, its directors, officers, employees, affiliates, agents, contractors, licensors, and service providers from any and all claims, liabilities, damages, judgments, awards, losses, costs, expenses, or fees (including reasonable attorneys ' fees) arising out of or relating to your violation of these Terms or your use of the Service, including, but not limited to:\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Your use of any content available on the Service, including any content that you upload, create, modify, distribute, or otherwise make available through the Service.\\nYour violation of any third-party right, including without limitation any intellectual property, privacy, or publicity right.\\nYour violation of any law, rule, or regulation.\\nAny claim or damage that arises from your use of any information, data, or material from the Service.\\nWe reserve the right to assume the exclusive defense and control of any matter otherwise subject to indemnification by you, in which event you will cooperate with us in asserting any available defenses.\"\n    }), \"\\n\", _jsx(_components.h3, {\n      id: \"termination\",\n      children: \"Termination\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"We may terminate or suspend your access to all or any part of the Service at any time, with or without cause, with or without notice, effective immediately. If you wish to terminate these Terms, you may discontinue using the Service.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"All provisions of these Terms, which by their nature should survive termination, shall survive termination, including, without limitation, ownership provisions, warranty disclaimers, indemnity, and limitations of liability.\"\n    }), \"\\n\", _jsx(_components.h3, {\n      id: \"governing-law-and-jurisdiction\",\n      children: \"Governing Law and Jurisdiction\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"These Terms shall be governed by and construed in accordance with the laws of the State of California, without regard to its conflict of law provisions.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Any legal suit, action, or proceeding arising out of, or related to, these Terms or the Service shall be instituted exclusively in the federal courts of the United States or the courts of the State of California in each case located in San Francisco County. You waive any and all objections to the exercise of jurisdiction over you by such courts and to venue in such courts.\"\n    }), \"\\n\", _jsx(_components.h3, {\n      id: \"entire-agreement\",\n      children: \"Entire Agreement\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"These Terms and our Privacy Policy constitute the sole and entire agreement between you and the Company regarding the Service and supersede all prior and contemporaneous understandings, agreements, representations, and warranties, both written and oral, regarding the Service.\"\n    }), \"\\n\", _jsx(_components.h3, {\n      id: \"no-waiver\",\n      children: \"No Waiver\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Our failure to enforce any right or provision of these Terms will not be deemed a waiver of such right or provision.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"If any provision of these Terms is held to be invalid or unenforceable by a court or other tribunal of competent jurisdiction, the remaining provisions of these Terms will remain in full force and effect.\"\n    }), \"\\n\", _jsx(_components.h3, {\n      id: \"assignment\",\n      children: \"Assignment\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"These Terms and any rights and licenses granted hereunder, may not be transferred or assigned by you, but may be assigned by us without restriction or notification.\"\n    }), \"\\n\", _jsx(_components.h3, {\n      id: \"force-majeure\",\n      children: \"Force Majeure\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"We shall not be liable for any failure to perform our obligations hereunder where such failure results from any cause beyond our reasonable control, including, without limitation, mechanical, electronic, or communications failure or degradation.\"\n    }), \"\\n\", _jsx(_components.h3, {\n      id: \"no-agency\",\n      children: \"No Agency\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"No agency, partnership, joint venture, or employment relationship is created as a result of these Terms, and you may not make any representations on our behalf.\"\n    }), \"\\n\", _jsx(_components.h3, {\n      id: \"headings\",\n      children: \"Headings\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"The section titles in these Terms are for convenience only and have no legal or contractual effect.\"\n    }), \"\\n\", _jsx(_components.h3, {\n      id: \"survival\",\n      children: \"Survival\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"All provisions of these Terms which by their nature should survive termination shall survive termination, including, without limitation, ownership provisions, warranty disclaimers, indemnity, and limitations of liability.\"\n    }), \"\\n\", _jsx(_components.h3, {\n      id: \"user-generated-content\",\n      children: \"User-Generated Content\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"The Service may allow you to submit, upload, publish, or otherwise make available content, including but not limited to text, images, audio, video, and other materials (\\\"User Content\\\"). You retain ownership of any intellectual property rights that you hold in the User Content, but you grant us a non-exclusive, royalty-free, transferable, sub-licensable, worldwide license to use, reproduce, distribute, prepare derivative works of, display, and perform your User Content in connection with the Service and our business, including without limitation for promoting and redistributing part or all of the Service (and derivative works thereof) in any media formats and through any media channels.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"You represent and warrant that you have all rights, licenses, consents, and releases that are necessary to grant to us the license above and that the User Content and your use of the Service will not infringe or violate any third-party rights, including without limitation any intellectual property, privacy, or publicity rights. We reserve the right to remove any User Content from the Service at any time and for any reason, including without limitation if it violates these Terms or our policies.\"\n    }), \"\\n\", _jsx(_components.h3, {\n      id: \"links-to-third-party-websites-or-resources\",\n      children: \"Links to Third-Party Websites or Resources\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"The Service may contain links to third-party websites or resources. We provide these links only as a convenience and are not responsible for the content, products, or services on or available from those websites or resources or links displayed on such websites. You acknowledge sole responsibility for and assume all risk arising from your use of any third-party websites or resources.\"\n    }), \"\\n\", _jsx(_components.h3, {\n      id: \"disclaimer-of-warranties-1\",\n      children: \"Disclaimer of Warranties\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"The Service is provided \\\"as is,\\\" without warranty of any kind, either express or implied, including without limitation any warranty for information, services, uninterrupted access, or products provided through or in connection with the Service, including without limitation the software licensed to you and the results obtained through the Service. Specifically, we disclaim any and all warranties, including without limitation: 1) Any warranties concerning the availability, accuracy, usefulness, or content of information, products, or services; and 2) Any warranties of title, warranty of non-infringement, warranties of merchantability, or fitness for a particular purpose. This disclaimer of liability applies to any damages or injury caused by any failure of performance, error, omission, interruption, deletion, defect, delay in operation or transmission, computer virus, communication line failure, theft, or destruction or unauthorized access to, alteration of, or use of record, whether for breach of contract, tortious behavior, negligence, or under any other cause of action.\"\n    }), \"\\n\", _jsx(_components.h3, {\n      id: \"limitation-of-liability-1\",\n      children: \"Limitation of Liability\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"To the fullest extent permitted by applicable law, in no event shall the Company, its affiliates, officers, directors, employees, agents, licensors, or service providers be liable for any direct, indirect, incidental, consequential, special, punitive, or exemplary damages, including without limitation damages for loss of profits, revenue, data, use, goodwill, or other intangible losses arising out of or relating to your use of the Service, whether based on warranty, contract, tort, negligence, strict liability, or any other legal theory, even if the Company has been advised of the possibility of such damages.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Some jurisdictions do not allow the exclusion or limitation of liability for consequential or incidental damages, so the above limitation may not apply to you.\"\n    }), \"\\n\", _jsx(_components.h3, {\n      id: \"waiver-and-severability\",\n      children: \"Waiver and Severability\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Our failure to enforce any right or provision of these Terms will not be deemed a waiver of such right or provision. If any provision of these Terms is held to be invalid or unenforceable by a court or other tribunal of competent jurisdiction, the remaining provisions of these Terms will remain in full force and effect.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"These Terms constitute the entire agreement between you and us regarding the Service and supersede all prior or contemporaneous understandings or agreements, whether written or oral, regarding the Service.\"\n    }), \"\\n\", _jsx(_components.h3, {\n      id: \"governing-law-and-dispute-resolution\",\n      children: \"Governing Law and Dispute Resolution\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"These Terms and any action related thereto will be governed by the laws of the State of [insert state], without regard to its conflict of law provisions. Any dispute arising from or relating to these Terms or the Service shall be resolved in accordance with the dispute resolution provisions outlined in our Privacy Policy.\"\n    }), \"\\n\", _jsx(_components.h3, {\n      id: \"changes-to-these-terms\",\n      children: \"Changes to These Terms\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"We reserve the right, at our sole discretion, to modify or replace these Terms at any time. If a revision is material, we will provide at least 30 days' notice prior to any new terms taking effect. What constitutes a material change will be determined at our sole discretion.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"By continuing to access or use the Service after any revisions become effective, you agree to be bound by the updated Terms. If you do not agree to the new Terms, you are no longer authorized to use the Service.\"\n    }), \"\\n\", _jsx(_components.h3, {\n      id: \"contact-us\",\n      children: \"Contact Us\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"If you have any questions about these Terms, please contact us at TBD.\"\n    })]\n  });\n}\nfunction MDXContent(props = {}) {\n  const {wrapper: MDXLayout} = Object.assign({}, _provideComponents(), props.components);\n  return MDXLayout ? _jsx(MDXLayout, Object.assign({}, props, {\n    children: _jsx(_createMdxContent, props)\n  })) : _createMdxContent(props);\n}\nreturn {\n  default: MDXContent\n};\n","frontmatter":{},"scope":{}}}},"__N_SSG":true}